#+title: Quando álgebra de ponto flutuante é um problema?
#+ROAM_TAGS: "Modelos não lineares" Simulação "Texto livre" "Ponto flutuante"

#+BEGIN_SRC python :session
import pandas as pd
import matplotlib.pyplot as plt
#+END_SRC

#+RESULTS:


* Qual devemos nos preocupar com álgrebra de ponto flutuante?


Se o modelo em questão for não-linear, a precisação da máquina pode influenciar os valores de longo prazo da similação.
Abaixo, apresenta-se o valor de precisão da máquina:

#+BEGIN_SRC python :session :results output
precisao = 0.1 + 0.2 - 0.3
print(precisao)
#+END_SRC

#+RESULTS:
: 5.551115123125783e-17

Sendo assim, caso este valor seja a taxa de crescimento da simulação e esta for rodada por vários períodos, pode fazer com que o valor seja diferente no longo prazo.

#+BEGIN_SRC python :session :results output
ns = 10**10 # Número de períodos simulados
Y0 = 100

Y = pd.DataFrame({"Y":[Y0*(1+precisao)^n for n in range(ns)]})

print(Y)
#+END_SRC

#+RESULTS:


